In [6]:
# start by importing some libraries that we will use
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import random

# to be able to reproduce the same results on every run 
# let's already generate the random seed
np.random.seed(444)

In [8]:
# concatenate Series objects
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])

# concat will use the index (rows) as default axis to concatenate
df = pd.concat([s1, s2]) 
df.head()

0    a
1    b
0    c
1    d
dtype: object

In [9]:
# concatenate by column
df = pd.concat([s1, s2], axis = 1)
df

   0  1
0  a  c
1  b  d

In [12]:
# Combine two DataFrame objects with identical columns.
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [13]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [14]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [15]:
df = pd.DataFrame({'temp_c': [17.0, 25.0]},
                  index=['Portland', 'Berkeley'])

In [16]:
df

          temp_c
Portland    17.0
Berkeley    25.0

In [18]:
import numpy as np
helper_min = np.where(df['temp_c'] > 20, 1,0)
df2 = df.assign(loc=helper_min.transform(min))

AttributeError: 'numpy.ndarray' object has no attribute 'transform'